app/Http/Controllers/Auth/AuthController.php

SELECT * FROM `settings` WHERE `settings`.`id` = 1 LIMIT 1
---
    public function getRegister()
    {
        $store_information = Settings::find(1);