app/Http/Controllers/Settings/RoleAccessController.php

SELECT * FROM `settings` WHERE `settings`.`id` = 1 LIMIT 1
SELECT * FROM `user_roles` WHERE `user_roles`.`id` in (1, 2, 3)
SELECT * FROM `users` ORDER BY `id` ASC
SELECT * FROM `user_roles`
---
    public function index()
    {
        $store_information = Settings::find(1);
        $user = User::with(['role'])->orderBy('id', 'asc')->get();
        $role = UserRole::all();

SELECT * FROM `settings` WHERE `settings`.`id` = 1 LIMIT 1
SELECT * FROM `user_roles`
---
    public function show(User $user_access)
    {
        $store_information = Settings::find(1);
        $role = UserRole::all();