app/Http/Controllers/Settings/RoleAccessController.php

    public function show(User $user_access)
    {
        $getTitle = Settings::find(1);
        $role = UserRole::all();
---
SELECT * FROM `settings` WHERE `settings`.`id` = 1 LIMIT 1
SELECT * FROM `user_roles`