app/Http/Controllers/Settings/SettingController.php

SELECT * FROM `settings` WHERE `settings`.`id` = 1 LIMIT 1
SELECT * FROM `settings`
---
    public function index()
    {
        //Variabel For Title Menu
        $getTitle = Settings::find(1);
        $settings = Settings::all();

SELECT * FROM `settings` WHERE `settings`.`id` = 1 LIMIT 1
---
    public function show(Settings $setting)
    {
        //Variabel For Title Menu
        $getTitle = Settings::find(1);