app/Http/Controllers/Main/DashboardController.php

SELECT * FROM `products`
SELECT sum(price_buy*stok) as aggregate FROM `products`
---
  public function index()
  {

    if( auth()->user()->role_id !== 1) {
      return redirect()->back()->with('error', 'Halaman tidak ditemukan !');
    }

    $stock = Products::all()->sum('stok');
    $totalBeli = DB::table('products')->sum(DB::raw('price_buy*stok'));