app/Http/Controllers/Main/DashboardController.php

  public function index()
  {
    $spending           = Spending::all();
    $store_information  = Settings::findOrFail(1);
    $order              = Order::with('member')->orderBy('id', 'desc')->get();
    $purchaseOrder      = PurchaseOrder::with('getSupplier')->orderBy('id', 'desc')->get();

    $orderByMonth = Order::whereMonth('created_at', Carbon::now()->month)
      ->whereYear('created_at', Carbon::now()->year)
        ->sum('total');

    $purchaseByMonth = PurchaseOrder::whereMonth('created_at', Carbon::now()->month)
      ->whereYear('created_at', Carbon::now()->year)
        ->sum('total');

    $spendingsByMonth = Spending::whereMonth('created_at', Carbon::now()->month)
      ->whereYear('created_at', Carbon::now()->year)
        ->sum('nominal');

    $profitByMonth = Order::whereMonth('created_at', Carbon::now()->month)
      ->whereYear('created_at', Carbon::now()->year)
        ->sum('total')     -
        PurchaseOrder::whereMonth('created_at', Carbon::now()->month)
          ->whereYear('created_at', Carbon::now()->year)
            ->sum('total') -
          Spending::whereMonth('created_at', Carbon::now()->month)
            ->whereYear('created_at', Carbon::now()->year)
              ->sum('nominal');

    $orderByDate = Order::whereDate('created_at', Carbon::now())->sum('total');

    $purchaseProduct = PurchaseProducts::whereDate('created_at', Carbon::now())->sum('qty');

    $soldProduct = OrderProduct::whereMonth('created_at', Carbon::now()->month)
      ->whereYear('created_at', Carbon::now()->year)
        ->sum('qty');
---
SELECT * FROM `spendings`
SELECT * FROM `settings` WHERE `settings`.`id` = 1 LIMIT 1
SELECT * FROM `Members` WHERE `Members`.`id` in (2, 3, 4)
SELECT * FROM `orders` ORDER BY `id` DESC
SELECT * FROM `purchase_orders` ORDER BY `id` DESC
SELECT * FROM `suppliers` WHERE `suppliers`.`id` in (1, 2)
SELECT sum(`total`) as aggregate FROM `orders` WHERE month(`created_at`) = '12' and year(`created_at`) = 2022
SELECT sum(`total`) as aggregate FROM `purchase_orders` WHERE month(`created_at`) = '12' and year(`created_at`) = 2022
SELECT sum(`nominal`) as aggregate FROM `spendings` WHERE month(`created_at`) = '12' and year(`created_at`) = 2022
SELECT sum(`total`) as aggregate FROM `orders` WHERE date(`created_at`) = '2022-12-22'
SELECT sum(`qty`) as aggregate FROM `purchase_products` WHERE date(`created_at`) = '2022-12-22'
SELECT sum(`qty`) as aggregate FROM `order_products` WHERE month(`created_at`) = '12' and year(`created_at`) = 2022