app/Http/Controllers/Main/SystemInfoController.php

    public function index()
    {
        $getTitle     = Settings::find(1);
        $categories = SystemCategories::all();
---
SELECT * FROM `settings` WHERE `settings`.`id` = 1 LIMIT 1
SELECT * FROM `system_categories`

    public function store(Request $request)
    {

        $rules = ['desc' => 'unique:system_information,desc'];

        $eMessage = ['desc.unique' => 'Data keterangan update sudah ada didatabase, coba buat kalimat yang berbeda ! '];

        $validator = Validator::make($request->all(), $rules, $eMessage);
---
SELECT * FROM `system_information`