app/Http/Controllers/Main/SystemUpdateController.php

SELECT * FROM `settings` WHERE `settings`.`id` = 1 LIMIT 1
SELECT * FROM `system_categories`
---
    public function index(Request $request)
    {
        if($request->has('search')){
            // $systemUpdate = SystemUpdate::where('desc', 'LIKE', '%'.$request->search.'%')->paginate(5);
            $systemUpdate = SystemUpdate::with(['category'])->where('category_id', 'LIKE', '%'.$request->search.'%')
                ->orWhere('desc', 'LIKE', '%'.$request->search.'%')
                    ->paginate(5);
        }else{
            $systemUpdate = SystemUpdate::with(['category'])->orderBy('id', 'desc')->paginate(5);
        }

        $getTitle     = Settings::find(1);
        $categories = SystemCategories::all();