app/Http/Controllers/Product/CategoryController.php

    public function index()
    {
        //Variabel For Title Menu
        $store_information = Settings::findOrFail(1);
---
SELECT * FROM `settings` WHERE `settings`.`id` = 1 LIMIT 1