app/Http/Controllers/Product/ProductController.php

    public function index()
    {
        //Variabel For Title Menu
        $store_information = Settings::findOrFail(1);
        $product = Products::with(['category'])->orderBy('id', 'ASC')->get();
---
SELECT * FROM `settings` WHERE `settings`.`id` = 1 LIMIT 1
SELECT * FROM `products` ORDER BY `id` DESC

    public function show(Products $product)
    {
        //Variabel For Title Menu
        $store_information = Settings::findOrFail(1);
        $categories = ProductsCategory::all();
---
SELECT * FROM `settings` WHERE `settings`.`id` = 1 LIMIT 1
SELECT * FROM `products_categories`

    public function deleteSelected(Request $request)
    {
        $rules = ['id' => 'required'];
        $eMessage = ['id.required' => 'Pilih produk yang ingin dihapus!'];
        $validator = Validator::make($request->all(), $rules, $eMessage);

        if ($validator->fails()) {
            return redirect()->back()->with('info', $validator->errors()->first());
        }

        $products = Products::withCount('orderProduct')->whereIn('id', $request->id)->get();

        foreach ($products as $product) {
			if ($product->order_product_count > 0) {
				return redirect()->back()->with('info', "Tidak dapat menghapus produk {$product->name}, terdapat {$product->order_product_count} total order di dalam produk tersebut!");
---
SELECT * FROM `products` WHERE `id` in ('8')
SELECT count(*) as aggregate FROM `products` WHERE `id` in ('2')