app/Http/Livewire/Purchase/Index.php

SELECT * FROM `suppliers`
---
    public function mount()
    {
        $this->supplier = Supplier::all();

SELECT * FROM `products` ORDER BY `id` ASC
SELECT * FROM `products` WHERE `products`.`id` in (1)
SELECT * FROM `purchase_transactions`
---
    public function render()
    {
        $products = Products::orderBy('id', 'ASC')->get();
        $purchase = PurchaseTransaction::with(['products'])->get();

SELECT * FROM `purchase_transactions` WHERE `purchase_transactions`.`id` = 19 LIMIT 1
UPDATE `purchase_transactions` SET `qty` = 1, `total` = 2900, `purchase_transactions`.`updated_at` = '2022-12-19 21:54:45' WHERE `id` = 19
SELECT * FROM `products` WHERE `products`.`id` = 1 LIMIT 1
SELECT * FROM `purchase_transactions`
---
    public function updateQty($id)
    {
        $purchase = PurchaseTransaction::find($id);

        if($this->update_qty == 0){
            return redirect()->route('purchase.index')->with('error', 'Isi jumlah produk yang ingin dibeli terlebih dahulu');
        }

        $purchase->update([
            'qty'   => $this->update_qty,
            'total' => $purchase->products->price_buy * $this->update_qty,
        ]);
        return redirect()->route('purchase.index')->with('success', 'Produk yang dipilih berhasil diupdate');