app/Http/Controllers/Sales/MemberController.php

    public function index()
    {
        //Variabel For Title Menu
        $store_information = Settings::findOrFail(1);;
        $member = Members::oldest()->get();
---
SELECT * FROM `settings` WHERE `settings`.`id` = 1 LIMIT 1
SELECT * FROM `members` ORDER BY `created_at` DESC

    public function store(Request $request)
    {
        $rules = [
            'name' => 'required',
            'member_status' => 'required',
            'code_member' => 'unique:members'
        ];

        $eMessage = [
            'name.required' => 'Nama member harus di isi !',
            'member_status.required' => 'Status member harus di isi !',
            'code_member.unique'    => 'Code member sudah terpakai !'
        ];

        $validator = Validator::make($request->all(), $rules, $eMessage);

        if ($validator->fails()){
            return redirect()->back()->with('warning', $validator->errors()->first());
        }

        $member = new Members();
        $member->code_member = $request->code_member;
        $member->name = $request->name;
        $member->address = $request->address;
        $member->number_phone = $request->number_phone;
        $member->member_status = $request->member_status;
        $member->save();
---
INSERT INTO `Members` (`code_member`, `name`, `address`, `number_phone`, `member_status`, `updated_at`, `created_at`) VALUES ('MBR-00004', 'Udin Ft Mamung', 'Depok', '0897071508', 'Non-Member', '2022-12-11 19:03:33', '2022-12-11 19:03:33')