app/Http/Controllers/Sales/PurchaseController.php

    public function index()
    {
        $store_information = Settings::find(1);
---
SELECT * FROM `settings` WHERE `settings`.`id` = 1 LIMIT 1

    public function store(Request $request)
    {
        $rules = [
            'product_id' => 'required|unique:purchase_transactions'
        ];

        $eMessage = [
            'product_id.required' => 'Pilih produk terlebih dahulu !',
            'product_id.unique' => 'Produk sudah ada dikeranjang !',
        ];

        $validator = Validator::make($request->all(), $rules, $eMessage);

        if ($validator->fails()){
        return redirect()->back()->with('warning', $validator->errors()->first());
        }

        $purchase = new PurchaseTransaction;
        $purchase->product_id = $request->product_id;
        $purchase->qty = $request->qty;
        $purchase->total = $request->total;
        $purchase->save();
---
INSERT INTO `purchase_transactions` (`product_id`, `qty`, `total`, `updated_at`, `created_at`) VALUES ('1', '0', '0', '2022-12-20 14:49:17', '2022-12-20 14:49:17')

    public function dataPurchase()
    {
        if(auth()->user()->role_id == 3)
        {
            return view('errors.403');
        }

        $store_information = Settings::find(1);
        $purchase          = PurchaseOrder::with(['getSupplier'])->orderBy('id', 'DESC')->get();
        $purchaseProduct   = PurchaseProducts::with(['getOrder', 'getProduct'])->orderBy('id', 'DESC')->get();
---
SELECT * FROM `settings` WHERE `settings`.`id` = 1 LIMIT 1
SELECT * FROM `purchase_orders` ORDER BY `id` DESC
SELECT * FROM `suppliers` WHERE `suppliers`.`id` in (1, 2)
SELECT * FROM `products` WHERE `products`.`id` in (1, 2, 3, 4, 5, 8)
SELECT * FROM `purchase_products` ORDER BY `id` DESC

    public function purchaseInvoice($purchase_order)
    {
        $store_information = Settings::find(1);
        $purchase = PurchaseOrder::with(['getSupplier', 'productOrder'])->where('purchase_order', $purchase_order)->first();
---
SELECT * FROM `settings` WHERE `settings`.`id` = 1 LIMIT 1
SELECT * FROM `purchase_orders` WHERE `purchase_order` = 'ORDER-202212221726' LIMIT 1
SELECT * FROM `suppliers` WHERE `suppliers`.`id` in (2)