app/Http/Controllers/Sales/SpendingController.php

SELECT * FROM `settings` WHERE `settings`.`id` = 1 LIMIT 1
SELECT * FROM `spendings` ORDER BY `id` DESC
---
    public function index()
    {
        //Variabel For Title Menu
        $store_information = Settings::findOrFail(1);
        $spending = Spending::orderBy('id', 'desc')->get();

SELECT * FROM `settings` WHERE `settings`.`id` = 1 LIMIT 1
---
    public function create()
    {
        //Variabel For Title Menu
        $store_information = Settings::findOrFail(1);