app/Http/Controllers/Sales/TransactionController.php

SELECT * FROM `Members` WHERE `Members`.`id` in (1, 2, 3)
---
    public function addMember(Request $request)
    {
        $orderMember = OrderMember::with('getMember')->where('add_by', '=', auth()->user()->id)->get();
        $count = $orderMember->count();

        $rules = [
            'member_id' => 'required|unique:order_members'
        ];

        $eMessage = [
            'member_id.required' => 'Pilih customer terlebih dahulu !',
            'member_id.unique'   => 'Customer sudah terpilih !',
        ];

        $validator = Validator::make($request->all(), $rules, $eMessage);

        foreach ($orderMember as $order) {
            if ($count > 0) {
                return redirect()->back()->with('error', "Terdapat customer {$order->getMember->name} sudah di input, hapus terlebih dahulu jika ingin mengganti customer!");