app/Http/Controllers/Sales/TransactionController.php

SELECT * FROM `settings` WHERE `settings`.`id` = 1 LIMIT 1
---
    public function index()
    {
        $store_information = Settings::find(1);

INSERT INTO `transactions` (`product_id`, `qty`, `total`, `updated_at`, `created_at`) VALUES ('1', '1', '3500', '2022-12-21 00:04:38', '2022-12-21 00:04:38')
---
    public function store(Request $request)
    {
        $rules = [
            'product_id' => 'required|unique:transactions'
        ];

        $eMessage = [
            'product_id.required' => 'Pilih produk terlebih dahulu !',
            'product_id.unique' => 'Produk sudah ada dikeranjang !',
        ];

        $validator = Validator::make($request->all(), $rules, $eMessage);

        if ($validator->fails()){
        return redirect()->back()->with('warning', $validator->errors()->first());
        }

        $transaction = new Transaction;
        $transaction->product_id = $request->product_id;
        $transaction->qty = $request->qty;
        $transaction->total = $request->total;
        $transaction->save();

SELECT * FROM `settings` WHERE `settings`.`id` = 1 LIMIT 1
SELECT * FROM `orders` WHERE `no_order` = 'INVOICE-202212224910' LIMIT 1
---
    public function invoice($no_order)
    {
        $store_information = Settings::find(1);
        $order = Order::with(['productOrder'])->where('no_order', $no_order)->first();

SELECT * FROM `order_products` WHERE `order_products`.`order_id` in (2)
SELECT * FROM `products` WHERE `products`.`id` in (2, 3, 4)
---
    public function dataTransaction()
    {
        $store_information = Settings::find(1);
        $order = Order::with(['productOrder'])->orderBy('id', 'DESC')->get();
        $orderProduct = OrderProduct::with(['getProduct', 'getOrder'])->orderBy('id', 'DESC')->get();