app/Http/Livewire/Transaction/Index.php

SELECT * FROM `Members`
SELECT * FROM `Members` WHERE `Members`.`id` in (2)
SELECT * FROM `order_members` LIMIT 1
SELECT * FROM `products` WHERE `products`.`id` in (4)
SELECT * FROM `transactions`
SELECT * FROM `products` ORDER BY `code_product` DESC
---
    public function render()
    {
        $member = Members::all();
        $orderMember = OrderMember::with('getMember')->limit(1)->get();
        $transaction = Transaction::with(['products'])->get();
        $products = Products::orderBy('code_product', 'desc')->get();

SELECT * FROM `order_members` LIMIT 1
SELECT * FROM `transactions`
SELECT * FROM `products` ORDER BY `id` ASC
INSERT INTO `orders` (`no_order`, `cashier_name`, `member_id`, `sub_total`, `discount`, `total`, `payment`, `change_money`, `updated_at`, `created_at`) VALUES ('INVOICE-202212117059', 'Bagas Arya Pradipta', 1, 3500, '0', 3500, '3500', 0, '2022-12-11 19:23:04', '2022-12-11 19:23:04')
SELECT * FROM `order_members`
SELECT * FROM `products` WHERE `products`.`id` in (2)
---
    public function checkout()
    {
        $this->validate();

        $orderMember = OrderMember::get();
        $transaction = Transaction::with('products')->get();

        $order = Order::create([
            'no_order'      => $this->no_order,
            'cashier_name'  => auth()->user()->name,
            'member_id'     => $orderMember->first()->member_id ?? 1,
            'sub_total'     => $transaction->sum('total'),
            'discount'      => $this->discount,
            'total'         => $transaction->sum('total') - $this->discount,
            'payment'       => $this->payment,
            'change_money'  => $this->payment - $transaction->sum('total') + $this->discount
        ]);

UPDATE `transactions` SET `qty` = 6, `total` = 21000, `transactions`.`updated_at` = '2022-12-09 03:48:09' WHERE `id` = 86
SELECT * FROM `products` WHERE `products`.`id` = 4 LIMIT 1
UPDATE `products` SET `stok` = `stok` - 1, `products`.`updated_at` = '2022-12-11 19:23:04' WHERE `id` = 4
INSERT INTO `order_products` (`order_id`, `product_id`, `qty`, `total`, `created_at`, `updated_at`) VALUES (3, 4, 1, 3500, '2022-12-11 19:23:04', '2022-12-11 19:23:04')
DELETE FROM `transactions` WHERE `id` = 6
---
                'updated_at'     => \Carbon\carbon::now()
            );

            Products::find($transaction->product_id)->decrement('stok', $transaction->qty);

            $orderProduct = OrderProduct::insert($product);

            $deleteTransaction = Transaction::where('id', $transaction->id)->delete();

SELECT * FROM `transactions`
---

        $this->clear();

        return redirect()->route('transaction.invoice', [$order->no_order] )->with('success', 'Pembayaran berhasil');

SELECT * FROM `transactions` WHERE `transactions`.`id` = 7 LIMIT 1
UPDATE `transactions` SET `qty` = 11, `total` = 38500, `transactions`.`updated_at` = '2022-12-20 22:10:31' WHERE `id` = 6
---
    public function plusQty($id)
    {
        $transaction = Transaction::find($id);
        $transaction->update([
            'qty' => $transaction->qty + 1,
            'total' => $transaction->products->price_sell * ($transaction->qty + 1),
        ]);

SELECT * FROM `transactions` WHERE `transactions`.`id` = 6 LIMIT 1
UPDATE `transactions` SET `qty` = 15, `total` = 52500, `transactions`.`updated_at` = '2022-12-20 22:11:22' WHERE `id` = 6
---
    public function minQty($id)
    {
        $transaction = Transaction::find($id);
        $transaction->update([
            'qty' => $transaction->qty - 1,
            'total' => $transaction->products->price_sell * ($transaction->qty - 1)
        ]);

SELECT * FROM `transactions` WHERE `transactions`.`id` = 5 LIMIT 1
---
    public function deleteCart()
    {
        $transaction = Transaction::where('id', $this->confirmDelete)->first();