app/Http/Livewire/Transaction/Index.php

SELECT * FROM `products` WHERE `products`.`id` in (1)
---
                    'updated_at'     => \Carbon\carbon::now(),
                );

                Products::find($transaction->product_id)->decrement('stok', $transaction->qty);

SELECT * FROM `products` WHERE `products`.`id` = 1 LIMIT 1
---
    public function plusQty($id)
    {
        $transaction = Transaction::with(['products'])->find($id);

SELECT * FROM `products` WHERE `products`.`id` = 1 LIMIT 1
---
    public function minQty($id)
    {
        $transaction = Transaction::with(['products'])->find($id);